In [1]:
#pip install gspread

In [3]:
import pandas as pd
import gspread

In [8]:
gc=gspread.service_account(filename='C:\\Users\\abstract-arbor-407518-ed570719ae38.json')

In [9]:
gc

In [10]:
sheet=gc.open_by_url('https://docs.google.com/spreadsheets/d/1LI1nT0WTmyttzodf1GFuGl-xh2ua4ZsN56ZWCAvioro/edit?usp=sharing')

In [11]:
sheet

In [13]:
ws=sheet.worksheet('Sheet1')

In [14]:
ws

In [15]:
df=pd.DataFrame(ws.get_all_records())

In [16]:
df

    student1 age1
0      nayem   25
1      hasib   26
2      jahid   25
3      tarek   26
4
..       ...  ...
994
995
996
997
998

[999 rows x 2 columns]

In [18]:
ws2=sheet.worksheet('Sheet2')
df2=pd.DataFrame(ws2.get_all_records())
df2

     student2 age2
0       sakib   26
1      rahman   27
2    mustakim   26
3        arif   27
4
..        ...  ...
994
995
996
997
998

[999 rows x 2 columns]